src/InformationRegisters/ЗамечанияКоммита/ЗамечанияКоммита.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗамечанияКоммита</name>
  <resources>
    <name>Замечание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ИмяОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерСтрокиОбъекта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Исправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Стандарт</name>
    <type>
      <types>CatalogRef.СтандартыРазработки</types>
    </type>
  </resources>
  <resources>
    <name>ПунктСтандарта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Критичное</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ЗадачаМетеор</name>
    <type>
      <types>CatalogRef.ЗадачиМетеор</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИсточникЗамечаний</name>
    <type>
      <types>EnumRef.ИсточникиЗамечаний</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Коммит</name>
    <type>
      <types>CatalogRef.ИсторияХранилища</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЗадачиМетеорВерсийХранилища/ЗадачиМетеорВерсийХранилища.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗадачиМетеорВерсийХранилища</name>
  <resources>
    <name>ЗадачаМетеор</name>
    <type>
      <types>CatalogRef.ЗадачиМетеор</types>
    </type>
  </resources>
  <dimensions>
    <name>ВерсияХранилища</name>
    <type>
      <types>CatalogRef.ИсторияХранилища</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ХешиGitВерсийХранилища/ХешиGitВерсийХранилища.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ХешиGitВерсийХранилища</name>
  <resources>
    <name>Хеш</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВерсияХранилища</name>
    <type>
      <types>CatalogRef.ИсторияХранилища</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ИсточникиЗамечаний/ИсточникиЗамечаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИсточникиЗамечаний</name>
  <enumValues>
    <name>ПроверкаКода</name>
  </enumValues>
  <enumValues>
    <name>Тестирование</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Хранилища/Хранилища.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Хранилища</name>
  <owners>Catalog.Конфигурации</owners>
  <attributes>
    <name>Путь</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьВGit</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПапкиGit</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВАПК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеРазработки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БазовоеХранилище</name>
    <type>
      <types>CatalogRef.Хранилища</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьТегиВGit</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогРезультатовПайплайнов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаИсторииСтрокаСоединения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаИсторииИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаИсторииПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаИсторииИмяПользователяХранилища</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаИсторииПарольХранилища</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаПереносаСтрокаСоединения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаПереносаИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаПереносаПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаПереносаИмяПользователяХранилища</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаПереносаПарольХранилища</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GitИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GitПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроектGit</name>
    <type>
      <types>CatalogRef.ПроектыGIT</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьHTTP</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьЗахваченныеОбъектыХранилищ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ИсторияХранилища/ИсторияХранилища.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИсторияХранилища</name>
  <owners>Catalog.Хранилища</owners>
  <attributes>
    <name>Автор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Метка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Изменены</name>
    <attributes>
      <name>ИмяОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Добавлены</name>
    <attributes>
      <name>ИмяОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Удалены</name>
    <attributes>
      <name>ИмяОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФайлыGit</name>
    <attributes>
      <name>Флаг</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Файл</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтарыйФайл</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтрокДобавлено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтрокУдалено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/ЗамечанияКоммита/ManagerModule.bsl
//////////////////////////////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
//////////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

Функция ЗамечанияПоЗадаче(ЗадачаМетеор, ИсточникЗамечаний) Экспорт

	Замечания = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗадачаМетеор", ЗадачаМетеор);
	Запрос.УстановитьПараметр("ИсточникЗамечаний", ИсточникЗамечаний);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Коммит,
	|	Коммит.Код КАК НомерКоммита,
	|	Представление(Автор) КАК Автор,
	|	Дата,
	|	Замечание,
	|	ИмяОбъекта,
	|	Критичное,
	|	НомерСтрокиОбъекта
	|ИЗ
	|	РегистрСведений.ЗамечанияКоммита
	|ГДЕ
	|	ЗадачаМетеор = &ЗадачаМетеор
	|	И ИсточникЗамечаний = &ИсточникЗамечаний
	|	И НЕ Исправлено
	|	
	|	УПОРЯДОЧИТЬ ПО
	|		Критичное УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.Замечание) Тогда
			Продолжить;
		КонецЕсли; 
		
		НомерКоммита = Выборка.НомерКоммита;
		Автор = Выборка.Автор;
		Дата = Выборка.Дата;
		
		Замечание = СтрШаблон("По коммиту %1 есть замечание от %2 (%3)", НомерКоммита, Автор, Дата);
		Если Выборка.Критичное Тогда
			Замечание = "КРИТИЧНОЕ ЗАМЕЧАНИЕ " + Замечание;
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.ИмяОбъекта) Тогда
			Замечание = Замечание + Символы.ПС + Выборка.ИмяОбъекта;
			Если ЗначениеЗаполнено(Выборка.НомерСтрокиОбъекта) Тогда
				Замечание = Замечание + СтрШаблон(" (%1)", Выборка.НомерСтрокиОбъекта);
			КонецЕсли; 
		КонецЕсли; 
		Замечание = Замечание + Символы.ПС + Выборка.Замечание;
		
		Замечания.Добавить(Замечание);
	
	КонецЦикла;
	
	ЗамечанияПоЗадаче = СтрСоединить(Замечания, Символы.ПС + Символы.ПС);
	
	Возврат ЗамечанияПоЗадаче;

КонецФункции

Процедура ЗагрузитьЗамечанияЗадачиМетеорИзGit(ЗадачаМетеор) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗадачаМетеор", ЗадачаМетеор);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗадачиМетеорВерсийХранилища.ВерсияХранилища КАК ВерсияХранилища
	|ИЗ
	|	РегистрСведений.ЗадачиМетеорВерсийХранилища КАК ЗадачиМетеорВерсийХранилища
	|ГДЕ
	|	ЗадачиМетеорВерсийХранилища.ЗадачаМетеор = &ЗадачаМетеор
	|	И НЕ ЗадачиМетеорВерсийХранилища.ВерсияХранилища.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		ЗагрузитьЗамечанияКоммитаИзGit(ЗадачаМетеор, Выборка.ВерсияХранилища);
	
	КонецЦикла; 

КонецПроцедуры

Процедура ЗагрузитьЗамечанияКоммитаИзGit(ЗадачаМетеор, Коммит) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Коммит", Коммит);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ХешиGitВерсийХранилища.Хеш КАК ХэшКоммита,
	|	ВЫБОР
	|		КОГДА ИсторияХранилища.Владелец.БазовоеХранилище = ЗНАЧЕНИЕ(Справочник.Хранилища.ПустаяСсылка)
	|			ТОГДА ИсторияХранилища.Владелец.ПроектGit.Код
	|		ИНАЧЕ ИсторияХранилища.Владелец.БазовоеХранилище.ПроектGit.Код
	|	КОНЕЦ КАК ИдентификаторПроектаГитЛаб
	|ИЗ
	|	Справочник.ИсторияХранилища КАК ИсторияХранилища
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ХешиGitВерсийХранилища КАК ХешиGitВерсийХранилища
	|		ПО (ХешиGitВерсийХранилища.ВерсияХранилища = ИсторияХранилища.Ссылка)
	|ГДЕ
	|	ИсторияХранилища.Ссылка = &Коммит";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ПараметрыАдреса = Новый Структура("ИдентификаторПроектаГитЛаб, ХэшКоммита");
	ЗаполнитьЗначенияСвойств(ПараметрыАдреса, Выборка);
	
	ДанныеОтвета = АвтоматизированнаяПроверкаКода.ВыполнитьЗапросКGit("comments", ПараметрыАдреса);
	
	Если ДанныеОтвета.КодСостояния < 300  Тогда
		
		Для каждого Замечание Из ДанныеОтвета.Результат Цикл
		
			Если Не ЗначениеЗаполнено(Замечание.path)
				И Замечание.author.username = "gitsync" Тогда
			
				Продолжить; // Пропускаем общие замечания от Сонара
			
			КонецЕсли; 
			
			ДатаЗамечания = XMLЗначение(Тип("Дата"), Замечание.created_at);
			Автор = Справочники.Пользователи.НайтиПоКоду(Замечание.author.username);
			
			НаборЗаписей = РегистрыСведений.ЗамечанияКоммита.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ЗадачаМетеор.Установить(ЗадачаМетеор);
			НаборЗаписей.Отбор.Коммит.Установить(Коммит);
			НаборЗаписей.Отбор.Дата.Установить(ДатаЗамечания);
			НаборЗаписей.Отбор.ИсточникЗамечаний.Установить(Перечисления.ИсточникиЗамечаний.ПроверкаКода);
			
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество() Тогда
				Запись = НаборЗаписей[0];
			Иначе
				Запись = НаборЗаписей.Добавить();
			КонецЕсли;
			
			Запись.ЗадачаМетеор = ЗадачаМетеор;
			Запись.Коммит = Коммит;
			Запись.Дата = ДатаЗамечания;
			Запись.ИсточникЗамечаний = Перечисления.ИсточникиЗамечаний.ПроверкаКода;
			
			Запись.Автор = Автор;
			
			Запись.Замечание = Замечание.note;
			Запись.ИмяОбъекта = Замечание.path;
			Запись.НомерСтрокиОбъекта= Замечание.line;
			Запись.Критичное = СтрНачинаетсяС(СокрЛП(Запись.Замечание), "!");
			
			НаборЗаписей.Записать();
		
		КонецЦикла; 
	Иначе
		Сообщить(ДанныеОтвета.Тело);
	КонецЕсли;

КонецПроцедуры
 
#КонецЕсли
